# ğŸ íŒŒì´ì¬ ë¨¸ì‹ ëŸ¬ë‹ ì™„ë²½ ê°€ì´ë“œ í˜¼ê³µ

### 2019.03.05 ~ 2019.03.28 êµì¬ 1,2ì¥

ì½”ë¡œë‚˜19 ì‚¬íƒœë¡œ 1,2ì¥ì€ í˜¼ì ê³µë¶€í•´ì•¼ í•˜ëŠ”ë°, ì–‘ì´ ë§ì•„ì„œ ë†ë•¡ì´ ë¶€ë¦¬ì§€ ë§ê³  ì—´ì‹¬íˆ í•˜ì^*^

01. íŒŒì´ì¬ ê¸°ë°˜ì˜ ë¨¸ì‹ ëŸ¬ë‹ê³¼ ìƒíƒœê³„ ì´í•´ 
02. ì‚¬ì´í‚·ëŸ°ìœ¼ë¡œ ì‹œì‘í•˜ëŠ” ë¨¸ì‹ ëŸ¬ë‹

Let's get startedâš½ï¸!

### 2020-03-09-Mon

ì§„ë„: 04. ë°ì´í„° í•¸ë“¤ë§ - íŒë‹¤ìŠ¤ ~ (39ìª½~)

### 04. ë°ì´í„° í•¸ë“¤ë§ - íŒë‹¤ìŠ¤ 

#### íŒë‹¤ìŠ¤ ì‹œì‘ - íŒŒì¼ì„ DataFrameìœ¼ë¡œ ë¡œë”©, ê¸°ë³¸ API

- íŒë‹¤ìŠ¤ëŠ” ë‹¤ì–‘í•œ í¬ë§·ìœ¼ë¡œ ëœ íŒŒì¼ì„ **DataFrame**ìœ¼ë¡œ ë¡œë”©í•  ìˆ˜ ìˆëŠ” í¸ë¦¬í•œ APIë¥¼ ì œê³µí•¨.
- **DataFrame**: í–‰ê³¼ ì—´ì„ ê°€ì§€ëŠ” 2ì°¨ì› ë°ì´í„°
- **read_csv()**: CSV(ì¹¼ëŸ¼ì„ ','ë¡œ êµ¬ë¶„í•œ íŒŒì¼ í¬ë§·) íŒŒì¼ í¬ë§· ë³€í™˜ì„ ìœ„í•œ API, **ì–´ë–¤ í•„ë“œ êµ¬ë¶„ ë¬¸ì ê¸°ë°˜ì˜ íŒŒì¼ í¬ë§·ë„ DataFrameìœ¼ë¡œ ë³€í™˜ ê°€ëŠ¥í•¨.** ì˜ˆë¥¼ ë“¤ì–´, read_dsv('íŒŒì¼ëª…', **sep='\t'**)ë¼ ì¨ì£¼ë©´ ì½¤ë§ˆ ëŒ€ì‹  íƒ­ìœ¼ë¡œ ë³€í™˜í•  ìˆ˜ ìˆìŒ.
- **read_table()**: ë””í´íŠ¸ í•„ë“œ êµ¬ë¶„ ë¬¸ìëŠ” íƒ­('\t') ë¬¸ì (csvëŠ” ì‰¼í‘œì„)
- **read_fwf()**: Fixed Width, ê³ ì • ê¸¸ì´ ê¸°ë°˜ì˜ ì¹¼ëŸ¼ í¬ë§·ì„ DataFrameìœ¼ë¡œ ë¡œë”©í•˜ê¸° ìœ„í•œ API

In [1]:
import numpy as np
import pandas as pd

- íŒŒì¼ ê²½ë¡œë¥¼ í™•ì‹¤í•˜ê²Œ ì„¤ì •í•´ì£¼ëŠ” ê²ƒì´ ì¤‘ìš”!
- ë™ì¼í•œ í´ë”ì— ìˆì„ ë•Œì—ëŠ” íŒŒì¼ëª…ë§Œ ì¨ì£¼ì–´ë„ ë˜ì§€ë§Œ, ë‹¤ë¥¸ í´ë”ì— ìˆì„ ê²½ìš°ì—ëŠ” êµ¬ì²´ì ì¸ ê²½ë¡œë¥¼ ì§€ì •í•´ì¤˜ì•¼ í•¨.
- read_csv()ëŠ” ë³„ë‹¤ë¥¸ íŒŒë¼ë¯¸í„° ì§€ì •ì´ ì—†ìœ¼ë©´ íŒŒì¼ì˜ ë§¨ ì²˜ìŒ ë¡œìš°ë¥¼ ì¹¼ëŸ¼ëª…ìœ¼ë¡œ ì¸ì§€í•˜ê³  ì¹¼ëŸ¼ìœ¼ë¡œ ë³€í™˜í•¨. 
- ë§¨ ì™¼ìª½ ì»¬ëŸ¼ì€ **íŒë‹¤ìŠ¤ì˜ Index ê°ì²´ ê°’**
- **df.head(n)**: ë°ì´í„°í”„ë ˆì„ì˜ ë§¨ ì•ì— ìˆëŠ” Nê°œì˜ ë¡œìš°ë¥¼ ë°˜í™˜

In [2]:
# ë™ì¼í•œ í´ë”ì— ìœ„ì¹˜í•  ê²½ìš°ì—ë§Œ ê°€ëŠ¥! ì´ íŒŒì¼ ìì²´ê°€ DataFrameìœ¼ë¡œ ì½íˆëŠ” ê²ƒ!
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
type(titanic_df)

pandas.core.frame.DataFrame

- **df.shape**: í–‰ê³¼ ì—´ í¬ê¸°ë¥¼ ì•Œ ìˆ˜ ìˆëŠ” ë°©ë²•

In [4]:
titanic_df.shape

(891, 12)

- **df.info()**: ì´ ë°ì´í„° ê±´ìˆ˜ì™€ Null ê±´ìˆ˜, ë°ì´í„° íƒ€ì…ì„ ì•Œ ìˆ˜ ìˆìŒ. 
- object ë°ì´í„° íƒ€ì…ì€ ë¬¸ìì—´ íƒ€ì…ì´ë¼ ìƒê°í•´ë„ ë¬´ë°©í•¨.

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- **df.describe()**: ì¹¼ëŸ¼ë³„ ìˆ«ìí˜• ë°ì´í„°ê°’ì˜ n-percentile ë¶„í¬ë„, í‰ê· ê°’, ìµœëŒ“ê°’, ìµœì†Ÿê°’ì„ ë‚˜íƒ€ëƒ„. ì˜¤ì§ ìˆ«ìí˜• ì¹¼ëŸ¼ì˜ ë¶„í¬ë„ë§Œ ì¡°ì‚¬í•˜ë©° ìë™ìœ¼ë¡œ object íƒ€ì…ì˜ ì¹¼ëŸ¼ì€ ì¶œë ¥ì—ì„œ ì œì™¸ì‹œí‚´. 
- count(Not Nullì¸ ë°ì´í„° ê±´ìˆ˜), mean(ì „ì²´ ë°ì´í„°ì˜ í‰ê· ê°’), std(í‘œì¤€í¸ì°¨), min(ìµœì†Ÿê°’), max(ìµœëŒ“ê°’), n%(n percentile ê°’)
- í•´ë‹¹ ìˆ«ì ì¹¼ëŸ¼ì´ ìˆ«ìí˜• ì¹´í…Œê³ ë¦¬ ì¹¼ëŸ¼(ì˜ˆ. ì—¬-1, ë‚¨-2)ì¸ì§€ë¥¼ íŒë‹¨í•  ìˆ˜ ìˆê²Œ ë„ì™€ì¤Œ. ì˜ˆë¥¼ ë“¤ì–´ SurvivedëŠ” ìµœì†Œê°€ 0, ìµœëŒ€ê°€ 1, ì¤‘ê°„ì—ëŠ” ê°’ì´ ì—†ìœ¼ë¯€ë¡œ ì¹´í…Œê³ ë¦¬í˜• ì¹¼ëŸ¼. Parch ì¹¼ëŸ¼ë„ ë§ˆì°¬ê°€ì§€!

In [6]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- **df['ì¹¼ëŸ¼ëª…']**: ë°ì´í„° í”„ë ˆì„ì˜ íŠ¹ì • ì¹¼ëŸ¼ë§Œ ë–¼ì–´ì„œ Seriesë¡œ ì“¸ ìˆ˜ ìˆìŒ. 
- **value_counts()**: í•´ë‹¹ ì¹¼ëŸ¼ê°’ì˜ ìœ í˜•ê³¼ ê±´ìˆ˜ë¥¼ í™•ì¸í•  ìˆ˜ ìˆìŒ.

In [7]:
value_counts = titanic_df['Pclass'].value_counts()
value_counts    # ì™¼ìª½ ì¹¼ëŸ¼ì´ Index!

3    491
1    216
2    184
Name: Pclass, dtype: int64

- **Series**: Indexì™€ ë‹¨ í•˜ë‚˜ì˜ ì¹¼ëŸ¼ìœ¼ë¡œ êµ¬ì„±ëœ ë°ì´í„° ì„¸íŠ¸

In [8]:
type(value_counts)

pandas.core.series.Series

#### DataFrameê³¼ ë¦¬ìŠ¤íŠ¸, ë”•ì…”ë„ˆë¦¬, ë„˜íŒŒì´ ndarray ìƒí˜¸ ë³€í™˜ 

ì‚¬ì´í‚·ëŸ°ì˜ ë§ì€ APIëŠ” ê¸°ë³¸ì ìœ¼ë¡œ ë„˜íŒŒì´ ndarrayë¥¼ ì…ë ¥ ì¸ìë¡œ ì‚¬ìš©í•˜ëŠ” ê²½ìš°ê°€ ëŒ€ë¶€ë¶„ì„. ê·¸ë˜ì„œ DataFrameê³¼ ë„˜íŒŒì´ ndarray ìƒí˜¸ ê°„ì˜ ë³€í™˜ì´ ë¹ˆë²ˆí•˜ê²Œ ë°œìƒ. 

##### ë„˜íŒŒì´ ndarray, ë¦¬ìŠ¤íŠ¸, ë”•ì…”ë„ˆë¦¬ë¥¼ DataFrameìœ¼ë¡œ ë³€í™˜í•˜ê¸°

- ë¦¬ìŠ¤íŠ¸ì™€ ë„˜íŒŒì´ ndarrayë¥¼ DataFrameìœ¼ë¡œ ë³€í™˜

In [9]:
col_name1 = ['col1']  # 1ì°¨ì› ë°ì´í„°ë¥¼ ê¸°ë°˜ìœ¼ë¡œ ìƒì„±í•˜ë‹ˆê¹Œ ì¹¼ëŸ¼ëª…ì€ 1ê°œ
list1 = [1,2,3]
array1 = np.array(list1)
array1.shape

(3,)

In [10]:
# ë¦¬ìŠ¤íŠ¸ë¥¼ ì´ìš©í•´ DataFrame ìƒì„± 
df_list1 = pd.DataFrame(list1, columns = col_name1)
df_list1

   col1
0     1
1     2
2     3

In [11]:
# ë„˜íŒŒì´ ndarrayë¥¼ ì´ìš©í•´ DataFrame ìƒì„± 
df_array1 = pd.DataFrame(array1, columns=col_name1)
df_array1

   col1
0     1
1     2
2     3

In [12]:
col_name2 = ['col1','col2','col3']  # 2*3ì´ë¯€ë¡œ ì¹¼ëŸ¼ëª…ì€ 3ê°œê°€ í•„ìš”

# 2í–‰x3ì—´ í˜•íƒœì˜ ë¦¬ìŠ¤íŠ¸ì™€ ndarray ìƒì„±í•œ ë’¤ ì´ë¥¼ DataFrameìœ¼ë¡œ ë³€í™˜
list2 = [[1,2,3],
        [11,12,13]]
array2 = np.array(list2)
array2.shape

(2, 3)

In [13]:
df_list2 = pd.DataFrame(list2, columns = col_name2)
df_list2

   col1  col2  col3
0     1     2     3
1    11    12    13

In [14]:
df_array2 = pd.DataFrame(array2, columns = col_name2)
df_list2

   col1  col2  col3
0     1     2     3
1    11    12    13

- ë”•ì…”ë„ˆë¦¬ë¥¼ DataFrameìœ¼ë¡œ ë³€í™˜
- ë”•ì…”ë„ˆë¦¬ì˜ í‚¤(key)ëŠ” ì»¬ëŸ¼ëª…ìœ¼ë¡œ, ë”•ì…”ë„ˆë¦¬ì˜ ê°’(value)ì€ í‚¤ì— í•´ë‹¹í•˜ëŠ” ì¹¼ëŸ¼ ë°ì´í„°ë¡œ ë³€í™˜

In [15]:
dict = {'col1':[1,11],'col2':[2,22],'col3':[3,33]}
df_dict = pd.DataFrame(dict)
df_dict

   col1  col2  col3
0     1     2     3
1    11    22    33

##### DataFrameì„ ë„˜íŒŒì´ ndarray, ë¦¬ìŠ¤íŠ¸, ë”•ì…”ë„ˆë¦¬ë¡œ ë³€í™˜í•˜ê¸° 

ğŸ‘ğŸ‘ğŸ‘ë§ì€ ë¨¸ì‹ ëŸ¬ë‹ íŒ¨í‚¤ì§€ê°€ ê¸°ë³¸ ë°ì´í„° í˜•ìœ¼ë¡œ ë„˜íŒŒì´ ndarrayë¥¼ ì‚¬ìš©í•¨. ê·¸ë˜ì„œ ë°ì´í„° í•¸ë“¤ë§ì€ DataFrameì„ ì´ìš©í•˜ë”ë¼ë„ ë¨¸ì‹ ëŸ¬ë‹ íŒ¨í‚¤ì§€ì˜ ì…ë ¥ ì¸ì ë“±ì— ì ìš©í•˜ê¸° ìœ„í•´ì„œëŠ” **ë‹¤ì‹œ ë„˜íŒŒì´ ndarrayë¡œ ë³€í™˜í•˜ëŠ” ê²½ìš°ê°€ ë¹ˆë²ˆí•˜ê²Œ ë°œìƒí•¨.** 

- **df.values**: ë°ì´í„°í”„ë ˆì„ì„ ndarrayë¡œ ë³€í™˜í•˜ê¸°

In [16]:
# DataFrameì„ ndarrayë¡œ ë³€í™˜ 
array3 = df_dict.values
print(type(array3),'\n', array3)

<class 'numpy.ndarray'>
 [[ 1  2  3]
 [11 22 33]]

- **df.values.tolist()**: ë°ì´í„°í”„ë ˆì„ì´ ë¦¬ìŠ¤íŠ¸ë¡œ ë³€í™˜. **tolist()**ëŠ” ë¦¬ìŠ¤íŠ¸ ìë£Œí˜•ìœ¼ë¡œ ë³€í™”ì‹œí‚¤ëŠ” ê²ƒ.
- **df.to_dict('list')**: ë°ì´í„°í”„ë ˆì„ì´ ë”•ì…”ë„ˆë¦¬ë¡œ ë³€í™˜

In [17]:
# DataFrameì„ ë¦¬ìŠ¤íŠ¸ë¡œ ë³€í™˜
list3= df_dict.values.tolist()
print(type(list3))
print(list3)

<class 'list'>
[[1, 2, 3], [11, 22, 33]]

In [18]:
# DataFrameì„ ë”•ì…”ë„ˆë¦¬ë¡œ ë³€í™˜ 
dict3 = df_dict.to_dict('list') # ì—¬ê¸° listëŠ” ë³€ìˆ˜ê°€ ì•„ë‹˜. 
print(type(dict3))
print(dict3)

<class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### 2020-03-10-Tue

ì§„ë„: 04. ë°ì´í„° í•¸ë“¤ë§ - íŒë‹¤ìŠ¤ ~ (52ìª½~)

#### DataFrameì˜ ì¹¼ëŸ¼ ë°ì´í„° ì„¸íŠ¸ ìƒì„±ê³¼ ìˆ˜ì •

- **df['ì¹¼ëŸ¼ëª…'] = ë°ì´í„°**: ìƒˆë¡œìš´ ì¹¼ëŸ¼ ë§Œë“¤ê¸°

In [19]:
titanic_df['Age_0'] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [20]:
# ê¸°ì¡´ ë°ì´í„°ë¡œ ìƒˆë¡œìš´ ì¹¼ëŸ¼ ì±„ì›Œë„£ê¸° 
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

#### DataFrame ë°ì´í„° ì‚­ì œ

- **df.drop()**: ë°ì´í„°ì˜ ì‚­ì œ 
- DataFrame.drop(**labels=None**, **axis=0**, index=None, columns=None, level=None, **inplace=False**, errors='raise'), ì¤‘ìš”í•œ íŒŒë¼ë¯¸í„°ê°€ labels, axis, inplace! 
- **axis íŒŒë¼ë¯¸í„°**: axis=0 ì´ë¼ë©´, rowê°€ ë“œë, axis=1ì´ë¼ë©´ columnì´ ë“œë!

In [21]:
# ì»¬ëŸ¼ ì‚­ì œí•˜ê¸° 
titanic_drop_df = titanic_df.drop('Age_0', axis = 1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0,1

In [22]:
# ê°„ë‹¨íˆ í‘œì‹œí•˜ëŠ” ë²•! axisë¥¼ ì ì§€ì•Šì•„ë„ ë¨!
titanic_drop_df = titanic_df.drop('Age_0', 1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0,1

- **inplace íŒŒë¼ë¯¸í„°**: defaultëŠ” inplace=False, ìê¸° ìì‹ ì˜ ë°ì´í„°í”„ë ˆì„ì˜ ë°ì´í„°ëŠ” ì‚­ì œí•˜ì§€ ì•ŠìŒ. 
- **inplace=False**: ìê¸° ìì‹ ì˜ ë°ì´í„°í”„ë ˆì„ì˜ ë°ì´í„°ëŠ” ì‚­ì œí•˜ì§€ ì•ŠìŒ. 
- **inplace=True**: ìê¸° ìì‹ ì˜ ë°ì´í„°í”„ë ˆì„ì˜ ë°ì´í„°ë„ ì‚­ì œí•¨. 
- ì—¬ëŸ¬ê°œ ë“œëí•˜ê³  ì‹¶ì„ ë•Œì—ëŠ” (labels)**['ë³€ìˆ˜ëª…1', 'ë³€ìˆ˜ëª…2',...]**ë¡œ ì ìœ¼ë©´ ë¨.
- ì¦‰, ì›ë³¸ DataFrameì„ ìœ ì§€í•˜ê³  ë“œë¡­ëœ DataFrameì„ ìƒˆë¡­ê²Œ ê°ì²´ ë³€ìˆ˜ë¡œ ë°›ê³  ì‹¶ë‹¤ë©´ inplace=Falseë¡œ ì„¤ì •í•˜ê³ , ì›ë³¸ DataFrameì— ë“œë¡­ëœ ê²°ê³¼ë¥¼ ì ìš©í•  ê²½ìš°ì—ëŠ” inplace=Trueë¥¼ ì ìš©!

In [23]:
# ì—¬ê¸°ì—ì„œ ë³´ë“¯, ì•ì˜ drop()ì€ ì› DataFrameì— ì˜í–¥ ë¯¸ì¹˜ì§€ ì•ŠìŒ. ì¦‰, Age_0ì´ ì‚´ì•„ìˆìŒ.
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [24]:
drop_result = titanic_df.drop(['Age_0','Age_by_10','Family_No'], axis=1, inplace=True)
print(drop_result)  # ì´ë ‡ë“¯ inplace=TrueëŠ” ì•„ì˜ˆ ê°ì²´ ë³€ìˆ˜ë¥¼ Noneìœ¼ë¡œ ë§Œë“¤ì–´ë²„ë¦¼.

None

In [25]:
# 3ê°œ ì¹¼ëŸ¼ì´ ëª¨ë‘ ì—†ì–´ì§„ ê²ƒì„ ë³¼ ìˆ˜ ìˆìŒ.
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [26]:
# row ì‚­ì œí•˜ê¸°!
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

#### Index ê°ì²´ 

- **index ê°ì²´**ëŠ” DataFrame, Seriesì˜ ë ˆì½”ë“œë¥¼ ê³ ìœ í•˜ê²Œ ì‹ë³„í•˜ëŠ” ê°ì²´
- **Series.index**, **DataFrame.index**ë¡œ index ê°ì²´ë§Œ ì¶”ì¶œí•  ìˆ˜ ìˆìŒ.
- ë°˜í™˜ëœ index ê°ì²´ì˜ ì‹¤ì œ ê°’ì€ ë„˜íŒŒì´ 1ì°¨ì› ndarrayì„.

In [27]:
# ì›ë³¸ íŒŒì¼ ë‹¤ì‹œ ë¡œë”© 
titanic_df = pd.read_csv('titanic_train.csv')
# index ê°ì²´ ì¶”ì¶œ 
indexes = titanic_df.index 
print(indexes,'\n')
# index ê°ì²´ë¥¼ ì‹¤ì œ ê°’ arrayë¡œ ë³€í™˜ 
print(indexes.values)

RangeIndex(start=0, stop=891, step=1)

[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [28]:
# ndarrayì™€ ìœ ì‚¬í•˜ê²Œ ë‹¨ì¼ ê°’ ë°˜í™˜ ë° ìŠ¬ë¼ì´ì‹±ë„ ê°€ëŠ¥í•¨. 
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [29]:
# í•œë²ˆ ë§Œë“¤ì–´ì§„ index ê°ì²´ëŠ” í•¨ë¶€ë¡œ ë³€ê²½í•  ìˆ˜ ì—†ìŒ. ì—ëŸ¬ê°€ ëœ¬ë‹¤.
# indexes[0] = 5

In [30]:
# indexëŠ” ì‹ë³„ìš©ì´ì§€, ì—°ì‚° ìˆ˜í–‰í•˜ì§€ ì•ŠìŒ. 
series_fair = titanic_df['Fare']
print('Fair Series max ê°’:', series_fair.max())
print('Fair Series sum ê°’:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series + 3:\n', (series_fair + 3).head(3))

Fair Series max ê°’: 512.3292
Fair Series sum ê°’: 28693.9493
sum() Fair Series: 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

- **df.reset_index()**: ìƒˆë¡­ê²Œ ì¸ë±ìŠ¤ë¥¼ ì—°ì† ìˆ«ìí˜•ìœ¼ë¡œ í• ë‹¹í•˜ë©°, ê¸°ì¡´ ì¸ë±ìŠ¤ëŠ” 'index'ë¼ëŠ” ìƒˆë¡œìš´ ì¹¼ëŸ¼ ëª…ìœ¼ë¡œ ì¶”ê°€í•¨. 
- ì¸ë±ìŠ¤ê°€ ì—°ì†ëœ int ìˆ«ìí˜• ë°ì´í„°ê°€ ì•„ë‹ ê²½ìš°ì— ë‹¤ì‹œ ì´ë¥¼ ì—°ì† int ìˆ«ìí˜• ë°ì´í„°ë¡œ ë§Œë“¤ ë•Œ ì£¼ë¡œ ì‚¬ìš©í•¨. 
- Seriesì— reset_index()ë¥¼ ì ìš©í•˜ë©´ Seriesê°€ ì•„ë‹Œ DataFrameì´ ë°˜í™˜ë¨.

In [31]:
# ë§¨ ì™¼ìª½ì´ ìƒˆë¡œìš´ index, index ì¹¼ëŸ¼ì´ ì—°ì† ìˆ«ìí˜•(ê¸°ì¡´ ì¸ë±ìŠ¤ì˜€ìŒ)
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [32]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…:', type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)               
print('new_value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…:', type(new_value_counts))

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…: <class 'pandas.core.series.Series'>
### After reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…: <class 'pandas.core.frame.DataFrame'>

#### ë°ì´í„° ì…€ë ‰ì…˜ ë° í•„í„°ë§ 

##### DataFrameì˜ [ ] ì—°ì‚°ì 

- DataFrame ë°”ë¡œ ë’¤ì— ìˆëŠ” '[ ]' ì•ˆì— ë“¤ì–´ê°ˆ ìˆ˜ ìˆëŠ” ê²ƒì€ ì¹¼ëŸ¼ ëª… ë¬¸ì ë˜ëŠ” ì¸ë±ìŠ¤ë¡œ ë³€í™˜ ê°€ëŠ¥í•œ í‘œí˜„ì‹ 
- DataFrame ë°”ë¡œ ë’¤ì˜ [ ] ì—°ì‚°ìëŠ” ë„˜íŒŒì´ë‚˜ Seriesì˜ [ ]ì™€ ë‹¤ë¦„.
- DataFrame ë°”ë¡œ ë’¤ì˜ [ ] ë‚´ ì…ë ¥ ê°’ì€ ì¹¼ëŸ¼ëª…ì„ ì§€ì •í•´ ì¹¼ëŸ¼ ì§€ì • ì—°ì‚°ì— ì‚¬ìš©í•˜ê±°ë‚˜ ë¶ˆë¦° ì¸ë±ìŠ¤ ìš©ë„ë¡œë§Œ ì‚¬ìš©í•´ì•¼ í•¨. 
- DataFrame[0:2]ì™€ ê°™ì€ ìŠ¬ë¼ì´ì‹± ì—°ì‚°ìœ¼ë¡œ ë°ì´í„°ë¥¼ ì¶”ì¶œí•˜ëŠ” ë°©ë²•ì€ ì‚¬ìš©í•˜ì§€ ì•ŠëŠ”ê²Œ ì¢‹ìŒ.

In [33]:
# ë‹¨ì¼ ì¹¼ëŸ¼ ë°ì´í„° ì¶”ì¶œ 
print(titanic_df['Pclass'].head(3))
# ì—¬ëŸ¬ ì¹¼ëŸ¼ ë°ì´í„° ì¶”ì¶œ 
print(titanic_df[['Survived','Pclass']].head(3))

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Survived  Pclass
0         0       3
1         1       1
2         1       3

In [34]:
# íŒë‹¤ìŠ¤ì˜ ì¸ë±ìŠ¤ í˜•íƒœë¡œ ë³€í™˜ ê°€ëŠ¥í•œ í‘œí˜„ì‹ 
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [35]:
# ë¶ˆë¦° ì¸ë±ì‹± í‘œí˜„ë„ ê°€ëŠ¥! ë§¤ìš° ìì£¼ ì‚¬ìš©. 
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

##### DataFrame ix[ ] ì—°ì‚°ì 

- ix[ ] ëŠ” ê³§ ì—†ì–´ì§ˆ ì˜ˆì •ì´ë¯€ë¡œ, **loc[]**ì´ë‚˜ **iloc[]**ì„ ì‚¬ìš©í•  ê²ƒì„ ë” ê¶Œì¥í•¨.
- ë„˜íŒŒì´ ndarray [ ] ì—°ì‚°ìì™€ ë™ì¼í•˜ê²Œ ë‹¨ì¼ ì§€ì •, ìŠ¬ë¼ì´ì‹±, ë¶ˆë¦° ì¸ë±ì‹±, íŒ¬ì‹œ ì¸ë±ì‹± ëª¨ë‘ ê°€ëŠ¥

In [36]:
data = {'Name' : ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
       'Year' : [2011, 2016, 2015, 2015],
       'Gender' : ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [37]:
# ì²«ë²ˆì§¸ ë¡œìš°, ì²«ë²ˆì§¸ ì¹¼ëŸ¼ ìœ„ì¹˜ì— ìˆëŠ” ë‹¨ì¼ ê°’ ë°˜í™˜
data_df.ix[0,0]

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:961: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  return getattr(section, self.name)[new_key]

'Chulmin'

In [38]:
# one ì¸ë±ìŠ¤ì˜ ì²«ë²ˆì§¸ ê°’
data_df.ix['one', 0]

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

'Chulmin'

In [39]:
data_df.ix[0:2, [0,1]]

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

         Name  Year
one   Chulmin  2011
two  Eunkyung  2016

### 2020-03-11-Wed

ì§„ë„: 04. ë°ì´í„° í•¸ë“¤ë§ - íŒë‹¤ìŠ¤ ~ (64ìª½~)

##### ëª…ì¹­ ê¸°ë°˜ ì¸ë±ì‹±ê³¼ ìœ„ì¹˜ ê¸°ë°˜ ì¸ë±ì‹±ì˜ êµ¬ë¶„ 

- ëª…ì¹­ ê¸°ë°˜ ì¸ë±ì‹±: ì¹¼ëŸ¼ì˜ ëª…ì¹­ì„ ê¸°ë°˜ìœ¼ë¡œ ìœ„ì¹˜ë¥¼ ì§€ì •í•˜ëŠ” ë°©ì‹ ex. loc[ ]
- ìœ„ì¹˜ ê¸°ë°˜ ì¸ë±ì‹±: 0ì„ ì¶œë°œì ìœ¼ë¡œ í•˜ëŠ” ê°€ë¡œì¶•, ì„¸ë¡œì¶• ì¢Œí‘œ ê¸°ë°˜ì˜ í–‰ê³¼ ì—´ ìœ„ì¹˜ ê¸°ë°˜ìœ¼ë¡œ ë°ì´í„°ë¥¼ ì§€ì •í•˜ëŠ” ë°©ì‹ ex. iloc[ ]

##### DataFrame iloc[ ] ì—°ì‚°ì 
- í–‰ê³¼ ì—´ ê°’ìœ¼ë¡œ integerë‚˜ intergerí˜•ì˜ ìŠ¬ë¼ì´ì‹±, íŒ¬ì‹œ ë¦¬ìŠ¤íŠ¸ ê°’ì„ ì…ë ¥í•´ì¤˜ì•¼ í•¨. 
- ë¶ˆë¦° ì¸ë±ì‹±ì€ ì œê³µí•˜ì§€ ì•ŠìŒ.

In [40]:
data_df.iloc[0,0]

'Chulmin'

In [41]:
data_df.iloc[1:3, 0]

two      Eunkyung
three    Jinwoong
Name: Name, dtype: object

##### DataFrame loc [ ] ì—°ì‚°ì 
- í–‰ ìœ„ì¹˜ì—ëŠ” DataFrame index ê°’ì„, ì—´ ìœ„ì¹˜ì—ëŠ” ì¹¼ëŸ¼ ëª… ì…ë ¥
- loc[ ]ì˜ ìŠ¬ë¼ì´ì‹± ê¸°í˜¸ë¥¼ ì ìš©í•˜ë©´ **ì¢…ë£Œ ê°’**ê¹Œì§€ í¬í•¨í•˜ëŠ” ê²ƒ!

In [42]:
data_df.loc['one', 'Name']

'Chulmin'

##### ë¶ˆë¦° ì¸ë±ì‹± 
- ix, iloc, locì™€ ê°™ì´ ëª…í™•íˆ ì¸ë±ì‹±ì„ ì§€ì •í•˜ëŠ” ë°©ì‹ë³´ë‹¤ëŠ” ë¶ˆë¦° ì¸ë±ì‹±ì— ì˜ì¡´í•´ ë°ì´í„°ë¥¼ ê°€ì ¸ì˜¤ëŠ” ê²½ìš°ê°€ ë” ë§ìŒ

In [43]:
# ìŠ¹ê° ì¤‘ ë‚˜ì´ê°€ 60ì„¸ ì´ìƒì¸ ë°ì´í„° ì¶”ì¶œ 
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))  # DataFrameìœ¼ë¡œ ì¶œë ¥ë¨
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [44]:
# ë¶ˆë¦° ì¸ë±ì‹± ê²°ê³¼ê°’ì´ ë°ì´í„°í”„ë ˆì„ì´ë¯€ë¡œ ë‹¤ì‹œ [ ]ë¥¼ í•´ì¤„ ìˆ˜ ìˆìŒ
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [45]:
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

- and ì¡°ê±´ì¼ ë•ŒëŠ” &
- or ì¡°ê±´ì¼ ë•ŒëŠ” |
- Not ì¡°ê±´ì¼ ë•ŒëŠ” ~

In [46]:
# ë‚˜ì´ê°€ 60ì„¸ ì´ìƒì´ê³ , ì„ ì‹¤ ë“±ê¸‰ì´ 1ë“±ê¸‰ì´ë©°, ì„±ë³„ì´ ì—¬ì„±ì¸ ìŠ¹ê°ì„ ì¶”ì¶œí•˜ê¸° 
titanic_df[(titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) & (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [47]:
# ê°œë³„ ì¡°ê±´ì„ ë³€ìˆ˜ì— í• ë‹¹í•´ì„œ ë³€ìˆ˜ë¥¼ ê²°í•©í•´ ë¶ˆë¦° ì¸ë±ì‹±ì„ ì‚¬ìš©í•  ìˆ˜ë„ ìˆìŒ. 
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[ cond1 & cond2 & cond3 ]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

### 2020-03-12-Thu

ì§„ë„: 04. ë°ì´í„° í•¸ë“¤ë§ - íŒë‹¤ìŠ¤ ~ ë! (74ìª½~86ìª½)

#### ì •ë ¬, Aggregation í•¨ìˆ˜, GroupBy ì ìš© 

##### DataFrame, Serieì˜ ì •ë ¬ - sort_values()

- **sort_values()**: DataFrameê³¼ Serieë¥¼ ì •ë ¬í•  ë•Œ ì‚¬ìš©
- ì£¼ìš” íŒŒë¼ë¯¸í„°ëŠ” **by, ascending, inplace**!

In [48]:
# ì´ë¦„ ì˜¤ë¦„ì°¨ìˆœ ì •ë ¬
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [51]:
# Pclassì™€ Nameì„ ë‚´ë¦¼ì°¨ìˆœìœ¼ë¡œ ì •ë ¬! 
titanic_sorted = titanic_df.sort_values(by=['Pclass','Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

##### Aggregation í•¨ìˆ˜ ì ìš© 

- aggregation í•¨ìˆ˜: min(), max(), sum(), count() ë“±

In [52]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [53]:
# íŠ¹ì • ì¹¼ëŸ¼ì—ë§Œ aggregation í•¨ìˆ˜ ì ìš©í•˜ê¸° 
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

#### groupby() ì ìš© 

- ë¶„ì„ ì‘ì—…ì— ë§ì´ í™œìš©í•¨. 
- groupby() ì‚¬ìš© ì‹œ ì…ë ¥ íŒŒë¼ë¯¸í„° byì— ì¹¼ëŸ¼ì„ ì…ë ¥í•˜ë©´ ëŒ€ìƒ ì¹¼ëŸ¼ìœ¼ë¡œ groupbyë¨.

In [54]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [55]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [58]:
# groupbyì˜ typeì´ DataFrameGroupByì´ê¸° ë•Œë¬¸ì— ì´ë ‡ê²Œ [ ]ê°€ ê°€ëŠ¥í•œ ê²ƒ
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [61]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [62]:
agg_format = {'Age':'max', 'SibSp':'sum','Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

#### ê²°ì† ë°ì´í„° ì²˜ë¦¬í•˜ê¸° 

- ê²°ì† ë°ì´í„°ëŠ” íŒë‹¤ìŠ¤ì—ì„œ NULLì¸ ê²½ìš°ê³ , numpyì˜ NaNìœ¼ë¡œ í‘œì‹œí•¨. 
- ê¸°ë³¸ì ìœ¼ë¡œ ë¨¸ì‹ ëŸ¬ë‹ ì•Œê³ ë¦¬ì¦˜ì€ ì´ NaN ê°’ì„ ì²˜ë¦¬í•˜ì§€ ì•Šìœ¼ë¯€ë¡œ ì´ ê°’ì„ ë‹¤ë¥¸ ê°’ìœ¼ë¡œ ëŒ€ì²´í•´ì•¼ í•¨. 
- NaN ê°’ì€ í‰ê· , ì´í•© ë“±ì˜ í•¨ìˆ˜ ì—°ì‚° ì‹œ ì œì™¸ë¨.

##### isna()ë¡œ ê²°ì† ë°ì´í„° ì—¬ë¶€ í™•ì¸
- **isna()**: NaN ì—¬ë¶€ë¥¼ í™•ì¸í•˜ëŠ” API

In [63]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [64]:
# ê²°ì† ë°ì´í„° ê°œìˆ˜ êµ¬í•˜ê¸° 
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

##### fillna()ë¡œ ê²°ì† ë°ì´í„° ëŒ€ì²´í•˜ê¸° 
- **fillna()**: NaN ê°’ì„ ë‹¤ë¥¸ ê°’ìœ¼ë¡œ ëŒ€ì²´í•˜ëŠ” API

In [65]:
# Cabin ì¹¼ëŸ¼ì˜ NaN ê°’ì„ 'C000'ìœ¼ë¡œ ëŒ€ì²´ 
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [70]:
# Age ì¹¼ëŸ¼ì˜ NaN ê°’ = í‰ê·  ë‚˜ì´, Embarked ì¹¼ëŸ¼ì˜ NaN ê°’ = Së¡œ ëŒ€ì²´í•˜ê¸° 
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()   # ê²°ì† ë°ì´í„°ê°€ í•˜ë‚˜ë„ ì—†ëŠ” ê²ƒìœ¼ë¡œ ëœ¸!

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

#### apply lambda ì‹ìœ¼ë¡œ ë°ì´í„° ê°€ê³µ 

- apply í•¨ìˆ˜ì— lambda ì‹ì„ ê²°í•©í•´ DataFrameì´ë‚˜ Seriesì˜ ë ˆì½”ë“œë³„ë¡œ ë°ì´í„°ë¥¼ ê°€ê³µí•˜ëŠ” ê¸°ëŠ¥ì„ ì œê³µí•¨. 
- ë³µì¡í•œ ë°ì´í„° ê°€ê³µì´ í•„ìš”í•  ê²½ìš° ì–´ì©” ìˆ˜ ì—†ì´ apply lambdaë¥¼ ì´ìš©í•œ ê²ƒ!
- lambda ì‹ì€ íŒŒì´ì¬ì—ì„œ í•¨ìˆ˜í˜• í”„ë¡œê·¸ë˜ë°ì„ ì§€ì›í•˜ê¸°ìœ„í•´ì„œ ë§Œë“  ê²ƒ

In [71]:
# ì…ë ¥ê°’ì˜ ì œê³± ê°’ì„ êµ¬í•´ì„œ ë°˜í™˜í•˜ëŠ” get_square(a) í•¨ìˆ˜ê°€ ìˆë‹¤ê³  í•˜ì. 
def get_square(a):
    return a**2

print('3ì˜ ì œê³±ì€:', get_square(3))

3ì˜ ì œê³±ì€: 9

In [72]:
# lambdaëŠ” ì´ëŸ¬í•œ í•¨ìˆ˜ì˜ ì„ ì–¸ê³¼ í•¨ìˆ˜ ë‚´ì˜ ì²˜ë¦¬ë¥¼ í•œ ì¤„ì˜ ì‹ìœ¼ë¡œ ì‰½ê²Œ ë³€í™˜í•˜ëŠ” ì‹
lambda_square = lambda x : x ** 2
print('3ì˜ ì œê³±ì€:', lambda_square(3))

3ì˜ ì œê³±ì€: 9

- lambda x : x ** 2
- lambda **ì…ë ¥ì¸ì** : **ì…ë ¥ ì¸ìë¥¼ ê¸°ë°˜ìœ¼ë¡œ í•œ ê³„ì‚°ì‹, í˜¸ì¶œ ì‹œ ê³„ì‚° ê²°ê³¼ê°€ ë°˜í™˜ë¨**
- ì—¬ëŸ¬ ê°œì˜ ê°’ì„ ì…ë ¥ì¸ìë¡œ ì‚¬ìš©í•  ê²½ìš° ë³´í†µ map()ë¥¼ ê²°í•©

In [73]:
a=[1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [74]:
# ì´ë¦„ ì² ì ê°œìˆ˜ ì„¸ê¸°
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head()

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22
3  Futrelle, M...        44
4  Allen, Mr. ...        24

In [75]:
# ë‚˜ì´ê°€ 15ì„¸ ë¯¸ë§Œì´ë©´ 'child', ê·¸ë ‡ì§€ ì•Šìœ¼ë©´ 'Adult'
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [76]:
# ë‚˜ì´ê°€ 15ì„¸ ì´í•˜ë©´ Child, 15~60ì„¸ ì‚¬ì´ëŠ” Adult, 61ì„¸ ì´ìƒì€ Elderly
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 
                                                else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [77]:
# ë‚˜ì´ì— ë”°ë¼ ì„¸ë¶„í™”ëœ ë¶„ë¥˜ë¥¼ ìˆ˜í–‰í•˜ëŠ” í•¨ìˆ˜ ìƒì„± 
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat 

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult